
INSERT INTO [Organization].[Dimensions].[Regions]([RegionName], [RegionTimezone])
VALUES	(N'Адыгея', 'UTC+3'),
		(N'Алтай', 'UTC+7'),
		(N'Алтайский', 'UTC+7'),
		(N'Амурская', 'UTC+9'),
		(N'Архангельская', 'UTC+3'),
		(N'Астраханская', 'UTC+4'),
		(N'Байконур', 'UTC+5'),
		(N'Башкортостан', 'UTC+5'),
		(N'Белгородская', 'UTC+3'),
		(N'Брянская', 'UTC+3'),
		(N'Бурятия', 'UTC+8'),
		(N'Владимирская', 'UTC+3'),
		(N'Волгоградская', 'UTC+3'),
		(N'Вологодская', 'UTC+3'),
		(N'Воронежская', 'UTC+3'),
		(N'Дагестан', 'UTC+3'),
		(N'Еврейская', 'UTC+10'),
		(N'Забайкальский', 'UTC+9'),
		(N'Ивановская', 'UTC+3'),
		(N'Ингушетия', 'UTC+3'),
		(N'Иркутская', 'UTC+8'),
		(N'Кабардино-Балкарская', 'UTC+3'),
		(N'Калининградская', 'UTC+2'),
		(N'Калмыкия', 'UTC+3'),
		(N'Калужская', 'UTC+3'),
		(N'Камчатский', 'UTC+12'),
		(N'Карачаево-Черкесская', 'UTC+3'),
		(N'Карелия', 'UTC+3'),
		(N'Кемеровская область - Кузбасс', 'UTC+7'),
		(N'Кировская', 'UTC+3'),
		(N'Коми', 'UTC+3'),
		(N'Костромская', 'UTC+3'),
		(N'Краснодарский', 'UTC+3'),
		(N'Красноярский', 'UTC+7'),
		(N'Крым', 'UTC+3'),
		(N'Курганская', 'UTC+5'),
		(N'Курская', 'UTC+3'),
		(N'Ленинградская', 'UTC+3'),
		(N'Липецкая', 'UTC+3'),
		(N'Магаданская', 'UTC+11'),
		(N'Марий Эл', 'UTC+3'),
		(N'Мордовия', 'UTC+3'),
		(N'Москва', 'UTC+3'),
		(N'Московская', 'UTC+3'),
		(N'Мурманская', 'UTC+3'),
		(N'Ненецкий', 'UTC+3'),
		(N'Нижегородская', 'UTC+3'),
		(N'Новгородская', 'UTC+3'),
		(N'Новосибирская', 'UTC+7'),
		(N'Омская', 'UTC+6'),
		(N'Оренбургская', 'UTC+5'),
		(N'Орловская', 'UTC+3'),
		(N'Пензенская', 'UTC+3'),
		(N'Пермский', 'UTC+5'),
		(N'Приморский', 'UTC+10'),
		(N'Псковская', 'UTC+3'),
		(N'Ростовская', 'UTC+3'),
		(N'Рязанская', 'UTC+3'),
		(N'Самарская', 'UTC+4'),
		(N'Санкт-Петербург', 'UTC+3'),
		(N'Саратовская', 'UTC+4'),
		(N'Саха /Якутия/', 'UTC+9'),
		(N'Сахалинская', 'UTC+11'),
		(N'Свердловская', 'UTC+5'),
		(N'Севастополь', 'UTC+3'),
		(N'Северная Осетия - Алания', 'UTC+3'),
		(N'Смоленская', 'UTC+3'),
		(N'Ставропольский', 'UTC+3'),
		(N'Тамбовская', 'UTC+3'),
		(N'Татарстан', 'UTC+3'),
		(N'Тверская', 'UTC+3'),
		(N'Томская', 'UTC+7'),
		(N'Тульская', 'UTC+3'),
		(N'Тыва', 'UTC+7'),
		(N'Тюменская', 'UTC+5'),
		(N'Удмуртская', 'UTC+4'),
		(N'Ульяновская', 'UTC+4'),
		(N'Хабаровский', 'UTC+10'),
		(N'Хакасия', 'UTC+7'),
		(N'Ханты-Мансийский Автономный округ - Югра', 'UTC+5'),
		(N'Челябинская', 'UTC+5'),
		(N'Чеченская', 'UTC+3'),
		(N'Чувашская Республика', 'UTC+3'),
		(N'Чукотский', 'UTC+12'),
		(N'Ямало-Ненецкий', 'UTC+5'),
		(N'Ярославская', 'UTC+3')

GO

INSERT INTO [Organization].[CRM].[Role]([RoleName])
VALUES	('Администратор'),
		('Менеджер департамента продаж'),
		('Менеджер группы продаж'),
		('Сотрудник продаж'),
		('Менеджер департамента сопровождения'),
		('Менеджер группы сопровождения'),
		('Сотрудник сопровождения'),
		('Менеджер департамента доставки'),
		('Менеджер группы доставки'),
		('Сотрудник доставки')

GO

INSERT INTO [Organization].[OrgStructure].[Positions]([PositionName])
VALUES	('Генеральный директор'),
		('Начальник департамента'),
		('Руководитель группы'),
		('Старший специалист'),
		('Специалист')

GO

INSERT INTO [Organization].[PersonalInfo].[Employees]([Login], [LastName], [FirstName], [MiddleName], [PositionId], [DateOfEmployment])
VALUES	('merinoviv', N'Меринов', N'Иван', N'Владимирович', 1, '20211106'),			--1
		('plissre', N'Плисс', N'Роман', N'Евгеньевич', 2, '20211106'),				--2

		('zlobinaod', N'Злобина', N'Оксана', N'Дмитриевна', 3, '20211106'),			--3
		('tihonovaes', N'Тихонова', N'Евгения', N'Степановна', 3, '20211106'),		--4
		('rasovvm', N'Расов', N'Виктор', N'Михайлович', 3, '20211106'),				--5

		('besedinala', N'Беседина', N'Людмила', N'Александровна', 4, '20211106'),	--6
		('solovyovaoa', N'Соловьёва', N'Оксана', N'Антоновна', 5, '20211106'),		--7

		('volkovalp', N'Волкова', N'Лариса', N'Петровна', 4, '20211106'),			--8
		('alekseevvi', N'Алексеев', N'Владимир', N'Иванович', 5, '20211106'),		--9

		('podlipalinamn', N'Подлипалина', N'Марина', N'Николаевна', 4, '20211106'),	--10
		('sherbenevamv', N'Щербенева', N'Марина', N'Валерьевна', 5, '20211106')		--11

GO

INSERT INTO [Organization].[OrgStructure].[Departments]([DepartmentName], [DepartmentManagerId])
VALUES	('Департамент управления', NULL),
		('Финансовый департамент', NULL),
		('Департамент кадрового учёта', NULL),
		('Департамент информационных технологий', NULL),
		('Департамент безопасности', NULL),
		('Административно-хозяйственный департамент', NULL),
		('Департамент развития', NULL),
		('Департамент продаж', 2),
		('Департамент сопровождения', NULL),
		('Департамент доставки', NULL)

GO

INSERT INTO [Organization].[OrgStructure].[Groups]([GroupName], [GroupDepartmentId], [GroupManagerId])
VALUES	(N'Группа 1', 8, 3),
		(N'Группа 2', 8, 4),
		(N'Группа 3', 8, 5)

GO

INSERT INTO [Organization].[CRM].[ContactResults]([ContactResultName])
VALUES	(N'Согласился'),
		(N'Отказался'),
		(N'Перезвонить'),
		(N'Не отвечает'),
		(N'Доставка'),
		(N'Консультация')

GO

INSERT INTO [Organization].[CRM].[Operators]([OperatorEmployeeId], [OperatorRoleId], [OperatorGroupId])
VALUES	(6, 4, 1),
		(7, 4, 1),
		(8, 4, 2),
		(9, 4, 2),
		(10, 4, 3),
		(11, 4, 3)

GO

--Клиенты
INSERT INTO [Organization].[PersonalInfo].[Clients]([LastName], [FirstName], [MiddleName], [Birthday], [Sex], [MobilNumber], [Email], [RegionId])
VALUES
(N'Шпилевский', N'Леонид', N'Анатольевич', '1979-12-12', 'M', '89639485480', NULL, 4),
(N'Иванова', N'Виктория', N'Андреевна', '1955-11-29', 'W', '89137028617', NULL, 46),
(N'Кочуров', N'Михаил', N'Викторович', '1973-02-12', 'M', '89231516277', NULL, 69),
(N'Птицына', N'Наталья', N'Георгиевна', '1969-03-28', 'W', '89132050164', NULL, 52),
(N'Ильин', N'Михаил', N'Михайлович', '1976-11-05', 'M', '89061935777', NULL, 12),
(N'Степанян', N'Роман', N'Еремович', '1955-02-15', 'M', '89059590284', NULL, 69),
(N'Бойкова', N'Лариса', N'Александровна', '1952-11-16', 'W', '89134839010', NULL, 48),
(N'Чернов', N'Максим', N'Юрьевич', '1984-03-26', 'M', '89137406921', NULL, 62),
(N'Копылов', N'Сергей', N'Владимирович', '1973-10-13', 'M', '89137463935', NULL, 10),
(N'Койнов', N'Алексей', N'Александрович', '1996-08-27', 'M', '89529277343', NULL, 48),
(N'Пятенко', N'Андрей', N'Николаевич', '1969-01-10', 'M', '89133816401', NULL, 83),
(N'Литвинова', N'Марина', N'Николаевна', '1953-09-26', 'W', '89513657503', NULL, 69),
(N'Брыкина', N'Зоя', N'Викторовна', '1956-09-06', 'W', '89513770648', NULL, 61),
(N'Епрев', N'Евгений', N'Геннадьевич', '1987-01-11', 'M', '89833070760', NULL, 16),
(N'Денисов', N'Сергей', N'Викторович', '1970-02-27', 'M', '89069085643', NULL, 9),
(N'Палий', N'Оксана', N'Николаевна', '1991-03-19', 'M', '89538652385', NULL, 35),
(N'Горюнов', N'Николай', N'Ильич', '1974-06-30', 'M', '89139517957', NULL, 65),
(N'Кокшаров', N'Дмитрий', N'Васильевич', '1974-04-25', 'M', '89529050123', NULL, 57),
(N'Понасенко', N'Галина', N'Дмитриевна', '1977-06-29', 'W', '89513944037', NULL, 32),
(N'Ярославцева', N'Евгения', N'Александровна', '1967-06-29', 'W', '89231991728', NULL, 86),
(N'Чернышева', N'Юлия', N'Михайловна', '1985-11-16', 'W', '89232288799', NULL, 16),
(N'Мосина', N'Светлана', N'Александровна', '1969-05-09', 'W', '89529102515', NULL, 83),
(N'Власов', N'Анатолий', N'Геннадьевич', '1979-01-08', 'M', '89137744708', NULL, 76),
(N'Чупин', N'Максим', N'Юрьевич', '1976-05-26', 'M', '89133734949', NULL, 39),
(N'Пигус', N'Максим', N'Игоревич', '1954-06-17', 'M', '89139518677', NULL, 30),
(N'Молокова', N'Мария', N'Андреевна', '1969-05-05', 'W', '89242522032', NULL, 35),
(N'Андрианова', N'Ирина', N'Петровна', '1952-01-02', 'W', '89137505446', NULL, 53),
(N'Перегудова', N'Анжелика', N'Александровна', '1992-08-17', 'W', '89833082348', NULL, 49),
(N'Варнавских', N'Ирина', N'Арестократовна', '1947-07-02', 'W', '89529138022', NULL, 46),
(N'Пестов', N'Александр', N'Владимирович', '1962-11-04', 'M', '89891974826', NULL, 51),
(N'Антонюк', N'Оксана', N'Васильевна', '1959-01-30', 'W', '89139388919', NULL, 43),
(N'Мельков', N'Андрей', N'Леонидович', '1978-04-21', 'M', '89133941779', NULL, 73),
(N'Полтева', N'Кристина', N'Александровна', '1992-02-01', 'W', '89529331934', NULL, 51),
(N'Арасланова', N'Наталья', N'Евгеньевна', '1991-10-15', 'W', '89137133150', NULL, 24),
(N'Белобородова', N'Анастасия', N'Алексеевна', '1966-05-19', 'W', '89139122391', NULL, 49),
(N'Донева', N'Наталья', N'Сергеевна', '1977-05-02', 'W', '89513860942', NULL, 86),
(N'Изотова', N'Валентина', N'Николаевна', '1958-11-15', 'W', '89538847212', NULL, 79),
(N'Суханов', N'Дмитрий', N'Михайлович', '1987-12-06', 'M', '89139547549', NULL, 36),
(N'Васильева', N'Елена', N'Юрьевна', '1992-10-02', 'W', '89134614308', NULL, 36),
(N'Нестерова', N'Нина', N'Георгиевна', '1968-01-19', 'W', '89132027912', NULL, 59),
(N'Базенко', N'Евгений', N'Васильевич', '1989-08-15', 'M', '89232275625', NULL, 84),
(N'Луневская', N'Людмила', N'Михайловна', '1991-12-10', 'W', '89137666760', NULL, 22),
(N'Гаврилюк', N'Виктор', N'Анатольевич', '1984-06-23', 'M', '89137591211', NULL, 33),
(N'Ларионова', N'Наталья', N'Николаевна', '1980-11-18', 'W', '89513664706', NULL, 69),
(N'Ряскин', N'Владимир', N'Викторович', '1982-04-01', 'M', '89538875133', NULL, 11),
(N'Булгакова', N'Татьяна', N'Викторовна', '1983-02-27', 'W', '89231391898', NULL, 68),
(N'Забора', N'Виктор', N'Иванович', '1987-09-25', 'W', '89059322355', NULL, 72),
(N'Яишницин', N'Максим', N'Сергеевич', '1950-04-11', 'M', '89537883143', NULL, 60),
(N'Нурлатова', N'Татьяна', N'Дмитриевна', '1981-05-05', 'W', '89132022066', NULL, 72),
(N'Дитюк', N'Роман', N'Сергеевич', '1955-10-21', 'M', '89130045615', NULL, 72),
(N'Щербенева', N'Марина', N'Валерьевна', '1989-06-21', 'W', '89130044811', NULL, 32),
(N'Шафроненко', N'Инесса', N'Юрьевна', '1975-11-25', 'W', '89138911200', NULL, 57),
(N'Табак', N'Михаил', N'Михайлович', '1976-12-27', 'M', '89231137295', NULL, 58),
(N'Паникаровских', N'Валерий', N'Геннадьевич', '1987-03-14', 'M', '89139572376', NULL, 5),
(N'Петров', N'Николай', N'Сергеевич', '1945-04-26', 'M', '89130168858', NULL, 21),
(N'Фелистов', N'Вячеслав', N'Александрович', '1982-08-15', 'M', '89231385828', NULL, 42),
(N'Казанцев', N'Андрей', N'Юрьевич', '1951-03-12', 'M', '89538656382', NULL, 80),
(N'Никоненко', N'Валентина', N'Ивановна', '1981-06-03', 'M', '89137414749', NULL, 50),
(N'Овчинникова', N'Нелля', N'Рашитовна', '1964-08-05', 'W', '89231717106', NULL, 48),
(N'Дмитриев', N'Сергей', N'Александрович', '1987-05-16', 'M', '89139247831', NULL, 75),
(N'Паршенков', N'Роман', N'Валерьевич', '1951-11-22', 'M', '89529171394', NULL, 5),
(N'Дворецкий', N'Максим', N'Анатольевич', '1952-04-21', 'M', '89529312252', NULL, 37),
(N'Беседина', N'Людмила', N'Александровна', '1986-07-23', 'W', '89137135287', NULL, 78),
(N'Жирякова', N'Юлия', N'Геннадьевна', '1986-01-20', 'W', '89513760060', NULL, 79),
(N'Тезов', N'Игорь', N'Викторович', '1966-05-24', 'M', '89231729555', NULL, 67),
(N'Коркин', N'Александр', N'Геннадьевич', '1941-12-26', 'M', '89537673979', NULL, 29),
(N'Чемодуров', N'Геннадий', N'Владимирович', '1986-07-02', 'M', '89537964527', NULL, 78),
(N'Штифанов', N'Дмитирй', N'Игоревич', '1957-07-28', 'M', '89130046323', NULL, 47),
(N'Дубровин', N'Андрей', N'Сергеевич', '1979-02-18', 'M', '89529358332', NULL, 44),
(N'Пылаева', N'Светлана', N'Валерьевна', '1970-02-04', 'W', '89537605785', NULL, 81),
(N'Плеханова', N'Анастасия', N'Викторовна', '1956-11-12', 'W', '89994663723', NULL, 77),
(N'Коннова', N'Валентина', N'Михайловна', '1980-06-30', 'W', '89130640429', NULL, 55),
(N'Далберг', N'Наталья', N'Юрьевна', '1968-02-14', 'W', '89139585840', NULL, 73),
(N'Аникина', N'Татьяна', N'Викторовна', '1961-01-26', 'W', '89231244572', NULL, 64),
(N'Сойченко', N'Светлана', N'Валерьевна', '1960-01-10', 'W', '89137178486', NULL, 21),
(N'Степанова', N'Галина', N'Алексеевна', '1992-02-09', 'W', '89139189403', NULL, 68),
(N'Иванов', N'Владимир', N'Олегович', '1985-06-03', 'M', '89137812611', NULL, 42),
(N'Громова', N'Ирина', N'Владимировна', '1977-03-03', 'W', '89137116906', NULL, 22),
(N'Епифанов', N'Владислав', N'Сергеевич', '1990-08-18', 'M', '89039375112', NULL, 19),
(N'Ханжиян', N'Наталья', N'Алексеевна', '1958-05-12', 'W', '89039359944', NULL, 61),
(N'Кобзева', N'Ольга', N'Николаевна', '1955-12-09', 'W', '89231530074', NULL, 15),
(N'Скородумов', N'Иван', N'Владимирович', '1987-05-11', 'M', '89537652053', NULL, 19),
(N'Меновщикова', N'Надежда', N'Леонидовна', '1976-04-14', 'W', '89231463107', NULL, 68),
(N'Гусельников', N'Сергей', N'Геннадьевич', '1948-01-06', 'M', '89134518602', NULL, 9),
(N'Седых', N'Елизавета', N'Александровна', '1986-11-10', 'W', '89537640225', NULL, 48),
(N'Демьяненко', N'Людмила', N'Вениаминовна', '1985-05-24', 'W', '89138928326', NULL, 28),
(N'Герасименко', N'Владимир', N'Васильевич', '1973-06-14', 'M', '89537651639', NULL, 12),
(N'Шокол', N'Антон', N'Анатольевич', '1977-08-23', 'M', '89137268622', NULL, 56),
(N'Апышко', N'Тамара', N'Марксовна', '1985-06-29', 'W', '89137424360', NULL, 10),
(N'Чехова', N'Ольга', N'Геннадьевна', '1974-12-18', 'W', '89139552680', NULL, 25),
(N'Гребенщиков', N'Александр', N'Владимироич', '1955-07-24', 'M', '89529257547', NULL, 19),
(N'Письменная', N'Светлана', N'Александровна', '1961-05-05', 'W', '89137389291', NULL, 83),
(N'Толстых', N'Мария', N'Алексеевна', '1994-10-22', 'W', '89232274750', NULL, 81),
(N'Прокопенко', N'Игорь', N'Николаевич', '1964-10-30', 'M', '89137673005', NULL, 69),
(N'Барковская', N'Людмила', N'Николаевна', '1959-04-06', 'W', '89137954146', NULL, 79),
(N'Гриенко', N'Андрей', N'Павлович', '1978-02-21', 'M', '89529358341', NULL, 22),
(N'Блинникова', N'Марина', N'Юрьевна', '1956-09-13', 'W', '89095318159', NULL, 60),
(N'Гочаков', N'Данил', N'Сергеевич', '1989-05-30', 'M', '89537964605', NULL, 73),
(N'Бредихина', N'Людмила', N'Филлиповна', '1990-12-05', 'W', '89132090914', NULL, 82),
(N'Мноцик', N'Ирина', N'Юрьевна', '1964-09-19', 'W', '89537698180', NULL, 49)

GO


--Контакты

--TRUNCATE TABLE [Organization].[CRM].[Contacts]

DECLARE @i INT = 0

DECLARE @operatorId	INT
DECLARE @maxOperatorId INT = (SELECT MAX([OperatorId]) FROM [CRM].[Operators])

DECLARE @clientId INT
DECLARE @maxClientId INT = (SELECT MAX([ClientId]) FROM [PersonalInfo].[Clients])

DECLARE @resultId INT
DECLARE @maxResultId INT = (SELECT MAX([ContactResultId]) FROM [CRM].[ContactResults])

DECLARE @nextActionDT DATETIME2

WHILE @i < 1000
BEGIN
	SET @i += 1

	SET @operatorId = (@i % @maxOperatorId) + 1
	SET @clientId = (@i % @maxClientId) + 1
	SET @resultId = (@i % @maxResultId) + 1

	IF @resultId = 3 SET @nextActionDT = DATEADD(DAY, 1, FORMAT(SYSDATETIME(), 'yyy-MM-dd'))
	IF @resultId = 4 SET @nextActionDT = DATEADD(HOUR, 2, SYSDATETIME())

	INSERT INTO [Organization].[CRM].[Contacts]([OperatorId], [ClientId], [ResultId], [NextActionDT])
	VALUES(@operatorId, @clientId, @resultId, @nextActionDT)

	EXEC CRM.AddContact @operatorId = @operatorId, @clientId = @clientId, @resultId = @resultId, @nextActionDT = @nextActionDT

	SET @nextActionDT = NULL
END